# Assignment 1: Question 1

Consider the _Payroll.csv_ dataset.

In [1]:
import numpy as np
import pandas as pd

In [2]:
payroll_df = pd.read_csv("Payroll.csv")
payroll_df

,EmployeeName,JobTitle,BasicSalary,OvertimePay,OtherPay,TotalPay,Year,Agency
0,Scott W Walton,Manager II,126346.04,0.0,1000.00,127346.04,2013.0,San Francisco
1,Brian W Byun,Engineer,132399.33,0.0,1913.44,134312.77,2013.0,San Francisco
2,Kenneth J Canedo,Police Officer 3,124723.62,10582.2,7001.51,137940.06,2013.0,San Francisco
3,Brett A Lundberg,General Laborer,117045.00,0.0,0.00,0.00,2014.0,San Francisco
4,Mark W Mcclure,General Laborer,114062.00,0.0,0.00,0.00,2014.0,San Francisco
...,...,...,...,...,...,...,...,...
148862,Roy I Tillery,Custodian,0.00,0.0,0.00,0.00,2014.0,San Francisco
148863,Not provided,Not provided,NaN,NaN,NaN,0.00,2014.0,San Francisco
148864,Not provided,Not provided,NaN,NaN,NaN,0.00,2014.0,San Francisco
148865,Not provided,Not provided,NaN,NaN,NaN,0.00,2014.0,San Francisco
148866,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.0,-618.13,-618.13,2014.0,San Francisco

1. How many rows does the dataset contain?

In [3]:
payroll_df.shape[0]

148867

2. What is the data type of each column?

In [4]:
payroll_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148867 entries, 0 to 148866
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   EmployeeName  148867 non-null  object
 1   JobTitle      148867 non-null  object
 2   BasicSalary   148258 non-null  float64
 3   OvertimePay   148713 non-null  float64
 4   OtherPay      148849 non-null  float64
 5   TotalPay      148867 non-null  float64
 6   Year          148684 non-null  float64
 7   Agency        148739 non-null  object
dtypes: float64(5), object(3)
memory usage: 9.1+ MB

3. a. How many duplicate rows are there in the dataset?

In [5]:
payroll_df.duplicated().sum()

222

3. b. Delete the duplicate rows. How many rows are left in the dataset?

In [6]:
payroll_df.drop_duplicates(inplace=True)

In [7]:
payroll_df.shape[0]

148645

**IMPORTANT: Use the new dataset (with the duplicates removed) to answer the remaining questions.**

4. How many missing values are there in each column?

In [8]:
payroll_df.isnull().sum()

EmployeeName      0
JobTitle          0
BasicSalary     606
OvertimePay     150
OtherPay         14
TotalPay          0
Year            183
Agency          128
dtype: int64

5. What is the average BasicSalary?

In [9]:
mean_df = payroll_df['BasicSalary'].mean()
median_df = payroll_df['BasicSalary'].median()
print ('The mean of the BasicSalary is', mean_df, 'and the median is', median_df)

The mean of the BasicSalary is 66333.88672680849 and the median is 65019.76

6. The BasicSalary column has missing data. 

    a.   Replace the missing values with the median value of the column. 
   
    b.  What do you call this method of handling missing data?
   
    c. Recalculate the average BasicSalary. How did it change?

In [10]:
payroll_df['BasicSalary'] = payroll_df['BasicSalary'].fillna(median_df)

## This method of handling missing data is called Median Imputation.

In [11]:
payroll_df['BasicSalary'].mean()

66328.52925904

### The mean has decreased.

7. How many outliers are there in the TotalPay column?

In [14]:
Q1 = payroll_df['TotalPay'].quantile(0.25)
Q3 = payroll_df['TotalPay'].quantile(0.75)

IQR = Q3 - Q1

upper_whisker = Q3 + 1.5 * IQR
lower_whisker = Q1 - 1.5 * IQR

print('Q1:',Q1, 'Q3:',Q3, 'IQR:', IQR)

Q1: 36126.88 Q3: 105846.06 IQR: 69719.18

In [13]:
outliers = payroll_df[(payroll_df['TotalPay'] > upper_whisker) | (payroll_df['TotalPay'] < lower_whisker)]
outliers_count = outliers.shape[0]
print('There are',outliers_count,'outliers in the TotalPay column')

There are 1283 outliers in the TotalPay column

<h3><center>End of Question 1</center></h3>